Documents/ИА_УстановкаКвотыСтатистик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_УстановкаКвотыСтатистик</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИА_КвотыСтатистик</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСтатистики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДетализации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ПериодыДетализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКвоты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ТипыКвот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИА_УстановкаКвотыСтатистик/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Объект.ВидСтатистики.Пустая() Тогда
		Если не Объект.ВидСтатистики.Аналитика1.Пустая() Тогда
			Элементы.Аналитика1.Заголовок = Объект.ВидСтатистики.Аналитика1.Наименование;
			Элементы.Аналитика1.Доступность = Истина;
		Конецесли;
		
		Если не ЗначениеЗаполнено(Объект.Аналитика1) Тогда
			УстановитьТип(Объект.ВидСтатистики.Аналитика1.ТипАналитикиПолный,Элементы.Аналитика1, Объект.Аналитика1);
		КонецЕсли;
		
		Если не Объект.ВидСтатистики.Аналитика2.Пустая() Тогда
			Элементы.Аналитика2.Заголовок = Объект.ВидСтатистики.Аналитика2.Наименование;
			Элементы.Аналитика2.Доступность = Истина;
		Конецесли;
		
		Если не ЗначениеЗаполнено(Объект.Аналитика2) Тогда
			УстановитьТип(Объект.ВидСтатистики.Аналитика2.ТипАналитикиПолный,Элементы.Аналитика2, Объект.Аналитика2);
		КонецЕсли;
		
		Если не Объект.ВидСтатистики.Аналитика3.Пустая() Тогда
			Элементы.Аналитика3.Заголовок = Объект.ВидСтатистики.Аналитика3.Наименование;
			Элементы.Аналитика3.Доступность = Истина;
		Конецесли;
		
		Если не ЗначениеЗаполнено(Объект.Аналитика3) Тогда
			УстановитьТип(Объект.ВидСтатистики.Аналитика3.ТипАналитикиПолный,Элементы.Аналитика3, Объект.Аналитика3);
		КонецЕсли;
			 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Квота = 0;
	КонецЕсли;
	
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
КонецПроцедуры

&НаСервере
Процедура УстановитьТип(ЗначТип,ЭлФормы,Рекв)
	Если ЗначТип = "" Тогда
		Возврат
	КонецЕсли;

    Массив = Новый Массив;
	Массив.Добавить(Тип(ЗначТип));       
	Стр = Новый ОписаниеТипов(Массив);
	ЭлФормы.ОграничениеТипа = Стр;                 
	ЭлФормы.ОграничениеТипа.ПривестиЗначение();
	
	ЗначТип1 = ЗначТип;
	ЗначТип1 = СтрЗаменить(ЗначТип1, "СправочникСсылка", "Справочники");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ДокументСсылка", "Документы");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ПеречислениеСсылка", "Перечисления");
	
	Если ЗначТип1 = "" Тогда 		
		Рекв = Справочники.ИА_ЗначениеАналитики.ПустаяСсылка();
	ИначеЕсли ЗначТип1 = "Булево" тогда 
		 Рекв = Ложь;
	ИначеЕсли  ЗначТип1 = "Строка" тогда	
		Рекв = "";
	ИначеЕсли ЗначТип1 = "Число" тогда
		Рекв = 0;
	ИначеЕсли ЗначТип1 = "Дата" тогда
		Рекв = Дата("01010001");
	Иначе
		Рекв = Вычислить(ЗначТип1+".ПустаяСсылка()");
	КонецЕсли;
	
	ЭлФормы.ВыбиратьТип = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВидСтатистикиПриИзменении(Элемент)
	Элементы.Аналитика1.Заголовок = "Аналитика1:";
	Элементы.Аналитика2.Заголовок = "Аналитика2:";
	Элементы.Аналитика3.Заголовок = "Аналитика3:";
	Объект.Аналитика1 = Неопределено;
	Объект.Аналитика2 = Неопределено;
	Объект.Аналитика3 = Неопределено;
	Элементы.Аналитика1.Доступность = Ложь;
	Элементы.Аналитика2.Доступность = Ложь;
	Элементы.Аналитика3.Доступность = Ложь;
	Объект.Квота = 0;
	
	
	СтатистикиВидСтатистикиПриИзменении_Сервер();
КонецПроцедуры

&НаСервере
Процедура СтатистикиВидСтатистикиПриИзменении_Сервер() Экспорт
	Если не Объект.ВидСтатистики.Пустая() Тогда
		Если не Объект.ВидСтатистики.Аналитика1.Пустая() Тогда
			Элементы.Аналитика1.Заголовок = Объект.ВидСтатистики.Аналитика1.Наименование;
			УстановитьТип1(Объект.ВидСтатистики.Аналитика1.ТипАналитикиПолный,Объект.Аналитика1);	
			Элементы.Аналитика1.Доступность = Истина;	
		Конецесли;
		
		Если не Объект.ВидСтатистики.Аналитика2.Пустая() Тогда
			Элементы.Аналитика2.Заголовок = Объект.ВидСтатистики.Аналитика2.Наименование;
			УстановитьТип1(Объект.ВидСтатистики.Аналитика2.ТипАналитикиПолный,Объект.Аналитика2);
			Элементы.Аналитика2.Доступность = Истина;	
		Конецесли;
		
		Если не Объект.ВидСтатистики.Аналитика3.Пустая() Тогда
			Элементы.Аналитика3.Заголовок = Объект.ВидСтатистики.Аналитика3.Наименование;
			УстановитьТип1(Объект.ВидСтатистики.Аналитика3.ТипАналитикиПолный,Объект.Аналитика3);
			Элементы.Аналитика3.Доступность = Истина;	
		Конецесли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьТип1(ЗначТип, ЗначСтр)	
	ЗначТип1 = ЗначТип;
	ЗначТип1 = СтрЗаменить(ЗначТип1, "СправочникСсылка", "Справочники");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ДокументСсылка", "Документы");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ПеречислениеСсылка", "Перечисления");
	Если ЗначТип1 = "" Тогда 		
		ЗначСтр = Справочники.ИА_ЗначениеАналитики.ПустаяСсылка();
	ИначеЕсли ЗначТип1 = "Булево" тогда 
		 ЗначСтр = Ложь;
	ИначеЕсли  ЗначТип1 = "Строка" тогда	
		ЗначСтр = "";
	ИначеЕсли ЗначТип1 = "Число" тогда
		ЗначСтр = 0;
	ИначеЕсли ЗначТип1 = "Дата" тогда
		ЗначСтр = Дата("01010001");
	Иначе
		ЗначСтр = Вычислить(ЗначТип1+".ПустаяСсылка()");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Аналитика1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораАналитики(1, Элемент, Неопределено, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Аналитика2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораАналитики(2, Элемент, Неопределено, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Аналитика3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораАналитики(3, Элемент, Неопределено, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораАналитики(номерАналитики, Элемент, тд, СтандартнаяОбработка)
	пт = ПолучитьПолныйТип(ОБъект.ВидСтатистики, номерАналитики);
	Если пт = "СправочникСсылка.ИА_ЗначениеАналитики" или пт = "" Тогда
		СтандартнаяОбработка = Ложь;
		
		СтруктураОтбора = Новый Структура("Владелец", ПолучитьЗначениеАналитики(Объект.ВидСтатистики,номерАналитики));
		ПараметрыВыбора1 = Новый Структура("Отбор", СтруктураОтбора);
		
		зн = Неопределено;

		
		ОткрытьФорму("Справочник.ИА_ЗначениеАналитики.Форма.ФормаВыбораУпр", ПараметрыВыбора1,,,,, Новый ОписаниеОповещения("НачалоВыбораАналитикиЗавершение", ЭтотОбъект, Новый Структура("номерАналитики", номерАналитики)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		Типы = новый Массив;
		Типы.Добавить(Тип(пт));
		Элемент.ОграничениеТипа = Новый ОписаниеТипов(Типы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораАналитикиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	номерАналитики = ДополнительныеПараметры.номерАналитики;
	
	
	зн = Результат;
	
	Если ЗначениеЗаполнено(зн) Тогда
		Объект["Аналитика"+номерАналитики] = зн;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьПолныйТип(ВидСтатистики, номерАналитики)
	Возврат ВидСтатистики["Аналитика"+номерАналитики].ТипАналитикиПолный;
КонецФункции

&НаСервере
Функция ПолучитьЗначениеАналитики(ВидСтатистики, номерАналитики)
	Возврат ВидСтатистики["Аналитика"+номерАналитики];
КонецФункции
